#include "l298n.h"
#include "delay.h"

/*==========================================
 *函数：L298N_Init
 *功能：L298N电机驱动模块初始化
 *
 *==========================================*/
void L298N_Init(void)	//初始化
{
	RCC->APB2ENR|=1<<2;    //使能PORTE时钟
	GPIOA->CRL&=0XFFFF000F;
	GPIOA->CRL|=0X00003330;     //PA1,2，3推挽输出
	GPIOA->ODR&=~(0x1<<1);      //PA.1输出低电平0
	GPIOA->ODR&=~(0x1<<2);      //PA.2输出低电平0
	GPIOA->ODR|= 0x1<<3;      //PA.3输出低电平1

}

/*==========================================
 *函数：MotorRun
 *功能：电机运行
 *
 *==========================================*/
void MotorRun(void)
{
	IN1 = 1;
	IN2 = 0;
}

/*==========================================
 *函数：MotorStop
 *功能：电机停止
 *
 *==========================================*/
void MotorStop(void)
{
	IN1 = 0;
	IN1 = 0;
}


